Rahix/avr-device/vendor/attiny85.atdf
        <register caption="Timer/Counter  Control Register A" name="TCCR0A" offset="0x4A" size="1">
          <bitfield caption="Compare Output Mode, Phase Correct PWM Mode" mask="0xC0" name="COM0A"/>
          <bitfield caption="Compare Output Mode, Fast PWm" mask="0x30" name="COM0B"/>
          <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM0"/>
        </register>
        <register caption="Timer/Counter Control Register B" name="TCCR0B" offset="0x53" size="1">
          <bitfield caption="Force Output Compare A" mask="0x80" name="FOC0A"/>
          <bitfield caption="Force Output Compare B" mask="0x40" name="FOC0B"/>
          <bitfield caption="" mask="0x08" name="WGM02"/>
          <bitfield caption="Clock Select" mask="0x07" name="CS0" values="CLK_SEL_3BIT_EXT"/>
        </register>
        <register caption="Timer/Counter0" name="TCNT0" offset="0x52" size="1" mask="0xFF"/>
        <register caption="Timer/Counter0 Output Compare Register" name="OCR0A" offset="0x49" size="1" mask="0xFF"/>
        <register caption="Timer/Counter0 Output Compare Register" name="OCR0B" offset="0x48" size="1" mask="0xFF"/>
        <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x4C" size="1">
          <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
          <bitfield caption="Prescaler Reset Timer/Counter1 and Timer/Counter0" mask="0x01" name="PSR0"/>
        </register>
      </register-group>
      <value-group caption="" name="CLK_SEL_3BIT_EXT">
        <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
        <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
        <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
        <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
        <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
        <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
        <value caption="Running, ExtClk Tx Falling Edge" name="VAL_0x06" value="0x06"/>
        <value caption="Running, ExtClk Tx Rising Edge" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Timer/Counter, 16-bit" name="TC16">
      <register-group caption="Timer/Counter, 16-bit" name="TC1">
        <register caption="Timer/Counter Control Register" name="TCCR1" offset="0x50" size="1">
          <bitfield caption="Clear Timer/Counter on Compare Match" mask="0x80" name="CTC1"/>
          <bitfield caption="Pulse Width Modulator Enable" mask="0x40" name="PWM1A"/>
          <bitfield caption="Compare Output Mode, Bits" mask="0x30" name="COM1A" values="CLK_COMP_MATCH_OUT_MODE"/>
          <bitfield caption="Clock Select Bits" mask="0x0F" name="CS1" values="CLK_SEL_4BIT"/>
        </register>
        <register caption="Timer/Counter Register" name="TCNT1" offset="0x4F" size="1" mask="0xFF" ocd-rw="R"/>
        <register caption="Output Compare Register" name="OCR1A" offset="0x4E" size="1" mask="0xFF"/>
        <register caption="Output Compare Register" name="OCR1B" offset="0x4B" size="1" mask="0xFF"/>
        <register caption="Output compare register" name="OCR1C" offset="0x4D" size="1" mask="0xFF"/>
        <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK" offset="0x59" size="1">
          <bitfield caption="OCIE1A: Timer/Counter1 Output Compare Interrupt Enable" mask="0x40" name="OCIE1A"/>
          <bitfield caption="OCIE1A: Timer/Counter1 Output Compare B Interrupt Enable" mask="0x20" name="OCIE1B"/>
          <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x04" name="TOIE1"/>
        </register>
        <register caption="Timer/Counter Interrupt Flag Register" name="TIFR" offset="0x58" size="1">
          <bitfield caption="Timer/Counter1 Output Compare Flag 1A" mask="0x40" name="OCF1A"/>
          <bitfield caption="Timer/Counter1 Output Compare Flag 1B" mask="0x20" name="OCF1B"/>
          <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x04" name="TOV1"/>
        </register>
        <register caption="Timer counter control register" name="GTCCR" offset="0x4C" size="1">
          <bitfield caption="Pulse Width Modulator B Enable" mask="0x40" name="PWM1B"/>
          <bitfield caption="Comparator B Output Mode" mask="0x30" name="COM1B"/>
          <bitfield caption="Force Output Compare Match 1B" mask="0x08" name="FOC1B"/>
          <bitfield caption="Force Output Compare 1A" mask="0x04" name="FOC1A"/>
          <bitfield caption="Prescaler Reset Timer/Counter1" mask="0x02" name="PSR1"/>
        </register>
        <register caption="Dead time prescaler register" name="DTPS" offset="0x43" size="1">
          <bitfield caption="" mask="0x03" name="DTPS"/>
        </register>
        <register caption="Dead time value register" name="DT1A" offset="0x45" size="1">
          <bitfield caption="" mask="0xF0" name="DTVH"/>
          <bitfield caption="" mask="0x0F" name="DTVL"/>
        </register>
        <register caption="Dead time value B" name="DT1B" offset="0x44" size="1">
          <bitfield caption="" mask="0xF0" name="DTVH"/>
          <bitfield caption="" mask="0x0F" name="DTVL"/>
        </register>
      </register-group>
      <value-group caption="" name="CLK_COMP_MATCH_OUT_MODE">
        <value caption="Disconnected from OCn/PWMn" name="VAL_0x00" value="0x00"/>
        <value caption="Toggle OCn/PWMn output line" name="VAL_0x01" value="0x01"/>
        <value caption="Clear OCn/PWMn output line" name="VAL_0x02" value="0x02"/>
        <value caption="set OCn/PWMn output line" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="CLK_SEL_4BIT">
        <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
        <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
        <value caption="Running, CLK/2" name="VAL_0x02" value="0x02"/>
        <value caption="Running, CLK/4" name="VAL_0x03" value="0x03"/>
        <value caption="Running, CLK/8" name="VAL_0x04" value="0x04"/>
        <value caption="Running, CLK/16" name="VAL_0x05" value="0x05"/>
        <value caption="Running, CLK/32" name="VAL_0x06" value="0x06"/>
        <value caption="Running, CLK/64" name="VAL_0x07" value="0x07"/>
        <value caption="Running, CLK/128" name="VAL_0x08" value="0x08"/>
        <value caption="Running, CLK/256" name="VAL_0x09" value="0x09"/>
        <value caption="Running, CLK/512" name="VAL_0x0A" value="0x0A"/>
        <value caption="Running, CLK/1024" name="VAL_0x0B" value="0x0B"/>
        <value caption="Running, CLK/2048" name="VAL_0x0C" value="0x0C"/>
        <value caption="Running, CLK/4096" name="VAL_0x0D" value="0x0D"/>
        <value caption="Running, CLK/8192" name="VAL_0x0E" value="0x0E"/>
        <value caption="Running, CLK/16384" name="VAL_0x0F" value="0x0F"/>
      </value-group>
    </module>
    <module caption="Bootloader" name="BOOT_LOAD">
      <register-group caption="Bootloader" name="BOOT_LOAD">
        <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1" ocd-rw="R">
          <bitfield caption="Read Device Signature Imprint Table" mask="0x20" name="RSIG"/>
          <bitfield caption="Clear temporary page buffer" mask="0x10" name="CTPB"/>
          <bitfield caption="Read fuse and lock bits" mask="0x08" name="RFLB"/>
          <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
          <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
          <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
        </register>
      </register-group>
    </module>
    <module caption="CPU Registers" name="CPU">
      <register-group caption="CPU Registers" name="CPU">
        <register caption="Status Register" name="SREG" offset="0x5F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
        <register caption="Power Reduction Register" name="PRR" offset="0x40" size="1">
          <bitfield caption="Power Reduction Timer/Counter1" mask="0x08" name="PRTIM1"/>
          <bitfield caption="Power Reduction Timer/Counter0" mask="0x04" name="PRTIM0"/>
          <bitfield caption="Power Reduction USI" mask="0x02" name="PRUSI"/>
          <bitfield caption="Power Reduction ADC" mask="0x01" name="PRADC"/>
        </register>
        <register caption="Stack Pointer  Bytes" name="SP" offset="0x5D" size="2" mask="0x03FF"/>
